[
  {
    "name": "Behavior Driven Development (BDD)",
    "ring": "adopt",
    "quadrant": "techniques",
    "isNew": "FALSE",
    "description": "Sub Category: Methodology\nPlacement Reason: Growing across IT industry. BDD offers more precise guidance on organizing the conversation between developers, testers and domain experts\nDescription: Behavior-driven development (BDD) is an Agile software development methodology in which an application is documented and designed around the behavior a user expects to experience when interacting with it"
  },
  {
    "name": "Test Driven Development (TDD)",
    "ring": "adopt",
    "quadrant": "techniques",
    "isNew": "FALSE",
    "description": "Sub Category: Methodology\nPlacement Reason: To write simple and just enough code. Provides quick Feedback. Standard development practice.\nDescription: Test-driven development (TDD) is a software development process relying on software requirements being converted to test cases before software is fully developed"
  },
  {
    "name": "Unit Testing",
    "ring": "adopt",
    "quadrant": "techniques",
    "isNew": "FALSE",
    "description": "Sub Category: Testing\nPlacement Reason: Best practice verify code functionality as atomic as possible and automated\nDescription: A unit test exercises the smallest piece of testable software in the application to determine whether it behaves as expected"
  },
  {
    "name": "Integration Testing",
    "ring": "adopt",
    "quadrant": "techniques",
    "isNew": "FALSE",
    "description": "Sub Category: Testing\nPlacement Reason: Best practice to verify the integration of microservices\nDescription: An integration test verifies the communication paths and interactions between components to detect interface defects"
  },
  {
    "name": "Component Testing",
    "ring": "adopt",
    "quadrant": "techniques",
    "isNew": "FALSE",
    "description": "Sub Category: Testing\nPlacement Reason: A component test limits the scope of the exercised software to a portion of the system under test, manipulating the system through internal code interfaces and using test doubles to isolate the code under test from other components.\nDescription: A component test limits the scope of the exercised software to a portion of the system under test, manipulating the system through internal code interfaces and using test doubles to isolate the code under test from other components"
  },
  {
    "name": "Consumer Driven Contract Testing",
    "ring": "adopt",
    "quadrant": "techniques",
    "isNew": "FALSE",
    "description": "Sub Category: Testing\nPlacement Reason: An integration contract test is a test at the boundary of an external service verifying that it meets the contract expected by a consuming service.\nDescription: An integration contract test is a test at the boundary of an external service verifying that it meets the contract expected by a consuming service"
  },
  {
    "name": "End-To-End Testing",
    "ring": "adopt",
    "quadrant": "techniques",
    "isNew": "FALSE",
    "description": "Sub Category: Testing\nPlacement Reason: Test Level in projects.\nDescription: An end-to-end test verifies that a system meets external requirements and achieves its goals, testing the entire system, from end to end"
  },
  {
    "name": "Chaos Testing",
    "ring": "trial",
    "quadrant": "techniques",
    "isNew": "TRUE",
    "description": "Sub Category: Testing\nPlacement Reason: I want to learn about.\nDescription: Chaos testing is a technique for testing software systems that are under the influence of external forces, such as external events, such as a network outage, or external processes, such as a process crash"
  },
  {
    "name": "Load- and Performance-Testing",
    "ring": "assess",
    "quadrant": "techniques",
    "isNew": "TRUE",
    "description": "Sub Category: Testing\nPlacement Reason: Test Discipline in projects.\nDescription: Load and performance testing is the process of putting demand on a system and measuring its response"
  },
  {
    "name": "Screenplay Pattern",
    "ring": "adopt",
    "quadrant": "techniques",
    "isNew": "FALSE",
    "description": "Sub Category: Testing\nPlacement Reason: ScreenPlay Pattern encourages better software engineering practices, and thus makes the tests faster to write and easier to maintain in the long term.\nDescription: The Screenplay Pattern is a user-centric model with users and external systems interacting with the system under test represented as actors"
  },
  {
    "name": "Page Object Model",
    "ring": "hold",
    "quadrant": "techniques",
    "isNew": "FALSE",
    "description": "Sub Category: Testing\nPlacement Reason: Page Objects cause problems like duplicate code, missing waits, and messy inheritance.\nDescription: Page Object Model, also known as POM, is a design pattern that creates an object repository for storing all web elements"
  },
  {
    "name": "Agile",
    "ring": "adopt",
    "quadrant": "techniques",
    "isNew": "FALSE",
    "description": "Sub Category: Methodology\nPlacement Reason: Highly used across IT industry and standard Development methodology\nDescription: Agile software development is more than frameworks such as Scrum, Extreme Programming, or Feature-Driven Development (FDD). https://www.agilealliance.org/agile101/"
  },
  {
    "name": "Scrum",
    "ring": "adopt",
    "quadrant": "techniques",
    "isNew": "FALSE",
    "description": "Sub Category: Methodology\nPlacement Reason: Scrum is a lightweight framework that helps people, teams and organizations generate value through adaptive solutions for complex problems.\nDescription: Scrum is a lightweight framework that helps people, teams and organizations generate value through adaptive solutions for complex problems"
  },
  {
    "name": "Kanban",
    "ring": "adopt",
    "quadrant": "techniques",
    "isNew": "FALSE",
    "description": "Sub Category: Methodology\nPlacement Reason: Kanban is a method applied across all fields of work to help teams drive down costs and become more efficient by visualizing and improving workflows.\nDescription: Kanban Board is a visual representation of the Agile task boards"
  },
  {
    "name": "DevOps",
    "ring": "assess",
    "quadrant": "techniques",
    "isNew": "FALSE",
    "description": "Sub Category: Methodology\nPlacement Reason: DevOps is important because it's a software development and operations approach that enables faster development of new products and easier maintenance of existing deployments.\nDescription: DevOps is a culture that enables formerly siloed roles—development, IT operations, quality engineering, and security to coordinate and collaborate to produce better, more reliable products"
  },
  {
    "name": "Kotlin",
    "ring": "adopt",
    "quadrant": "languages",
    "isNew": "FALSE",
    "description": "Placement Reason: Kotlin is a language that supports multiplatform targets, you can run Kotlin on virtually any device these days, be it a PC or a Mac, and also as native code.\nDescription: Kotlin is a multiplatform, statically typed, general-purpose programming language"
  },
  {
    "name": "Java",
    "ring": "adopt",
    "quadrant": "languages",
    "isNew": "FALSE",
    "description": "Placement Reason: Widely used.\nDescription: Java is a multi-platform, object-oriented, and network-centric language"
  }, 
  {
    "name": "Python",
    "ring": "adopt",
    "quadrant": "languages",
    "isNew": "FALSE",
    "description": "Placement Reason: Widely used.\nDescription: Python is an interpreted, object-oriented, high-level programming language with dynamic semantics"
  },
  {
    "name": "C#",
    "ring": "adopt",
    "quadrant": "languages",
    "isNew": "FALSE",
    "description": "Placement Reason: Widely used.\nDescription: C# is a modern, object-oriented, and type-safe programming language"
  },
  {
    "name": "TypeScript",
    "ring": "adopt",
    "quadrant": "languages",
    "isNew": "FALSE",
    "description": "Placement Reason: Widely used in JS Projects.\nDescription: TypeScript a strict syntactical superset of JavaScript and adds optional static typing to the language"
  },
  {
    "name": "JavaScript",
    "ring": "adopt",
    "quadrant": "languages",
    "isNew": "FALSE",
    "description": "Placement Reason: Widely used.\nDescription: JavaScript is a dynamic computer programming language"
  },
  {
    "name": "GoLang",
    "ring": "trial",
    "quadrant": "languages",
    "isNew": "TRUE",
    "description": "Placement Reason: I want to learn about.\nDescription: Go is an open source programming language used for general purpose"
  },
  {
    "name": "Scala",
    "ring": "trial",
    "quadrant": "languages",
    "isNew": "TRUE",
    "description": "Placement Reason: I want to learn about Scala. It combines object-oriented and functional programming in one concise, high-level language.\nDescription: Scala is a modern multi-paradigm programming language designed to express common programming patterns in a concise, elegant, and type-safe way"
  },
  {
    "name": "AWS Lambda",
    "ring": "adopt",
    "quadrant": "platforms",
    "isNew": "TRUE",
    "description": "Sub Category: Cloud services\nPlacement Reason: Good experience with set up and handling Lambda Functions and Event Driven Architectures.\nDescription: AWS Lambda is an event-driven computing cloud service from Amazon Web Services that allows developers to program functions on a pay-per-use basis without having to provision storage or compute resources to support them"
  },
  {
    "name": "AWS Aurora",
    "ring": "assess",
    "quadrant": "platforms",
    "isNew": "TRUE",
    "description": "Sub Category: Cloud services\nPlacement Reason: Learn about and make a Deep Dive.\nDescription: Amazon Aurora is a MySQL and PostgreSQL-compatible relational database built for the cloud"
  },
  {
    "name": "AWS DynamoDB",
    "ring": "assess",
    "quadrant": "platforms",
    "isNew": "TRUE",
    "description": "Sub Category: Cloud services\nPlacement Reason: Learn about and make a Deep Dive.\nDescription: Amazon DynamoDB is a fast and flexible NoSQL database service for all applications that need consistent, single-digit millisecond latency"
  },
  {
    "name": "Azure Functions",
    "ring": "hold",
    "quadrant": "platforms",
    "isNew": "TRUE",
    "description": "Sub Category: Cloud services\nPlacement Reason: Really expensive and hard to work with.\nDescription: Microsoft Azure is Microsoft's public cloud computing platform"
  },
  {
    "name": "Google Cloud Build",
    "ring": "adopt",
    "quadrant": "platforms",
    "isNew": "TRUE",
    "description": "Sub Category: Cloud services\nPlacement Reason: Good to go.\nDescription: Google Cloud Platform is a suite of public cloud computing services offered by Google"
  },
  {
    "name": "Google Cloud Run",
    "ring": "adopt",
    "quadrant": "platforms",
    "isNew": "TRUE",
    "description": "Sub Category: Cloud services\nPlacement Reason: Really great if you run your container better than AWS.\nDescription: Google Cloud Platform is a suite of public cloud computing services offered by Google"
  },
  {
    "name": "Google Cloud Function",
    "ring": "adopt",
    "quadrant": "platforms",
    "isNew": "TRUE",
    "description": "Sub Category: Cloud services\nPlacement Reason: Great to work with.\nDescription: Google Cloud Platform is a suite of public cloud computing services offered by Google"
  },
  {
    "name": "Playwright",
    "ring": "adopt",
    "quadrant": "frameworks & tools",
    "isNew": "FALSE",
    "description": "Sub Category: Frameworks\nPlacement Reason: Playwright enables fast, reliable and capable testing and automation across all modern browsers.\nDescription: Playwright is an out-of-process automation driver that is not limited by the scope of in-page JavaScript execution and can automate scenarios with multiple pages."
  },
  {
    "name": "7Facette",
    "ring": "adopt",
    "quadrant": "frameworks & tools",
    "isNew": "FALSE",
    "description": "Sub Category: Library\nPlacement Reason:  It is designed to provide a structure for developing higher quality automated acceptance and regression tests easier and faster\nDescription: 7Facette is an open-source multiplatform test automation library supporting JVM and JS."
  },
  {
    "name": "Selenium",
    "ring": "hold",
    "quadrant": "frameworks & tools",
    "isNew": "FALSE",
    "description": "Sub Category: Frameworks\nPlacement Reason: Benchmarking not as good as Playwright.\nDescription: Selenium is a web automation framework for testing web applications"
  },
  {
    "name": "Appium",
    "ring": "assess",
    "quadrant": "frameworks & tools",
    "isNew": "FALSE",
    "description": "Sub Category: Frameworks\nPlacement Reason: Good open source mobile automation solution.\nDescription: Appium is a mobile automation framework for testing mobile applications"
  },
  {
    "name": "Cypress",
    "ring": "hold",
    "quadrant": "frameworks & tools",
    "isNew": "FALSE",
    "description": "Sub Category: Frameworks\nPlacement Reason: Don't support cross domain handling.\nDescription: Cypress is a JavaScript testing framework for testing web applications"
  },
  {
    "name": "Jest",
    "ring": "adopt",
    "quadrant": "frameworks & tools",
    "isNew": "FALSE",
    "description": "Sub Category: Frameworks\nPlacement Reason: One of the best JS Testing Frameworks.\nDescription: Jest is a JavaScript testing framework for testing web applications"
  },
  {
    "name": "Mocha",
    "ring": "adopt",
    "quadrant": "frameworks & tools",
    "isNew": "FALSE",
    "description": "Sub Category: Frameworks\nPlacement Reason: Mocha is a testing library for Node. js, created to be a simple, extensible, and fast. It's used for unit and integration testing, and it's a great candidate for BDD (Behavior Driven Development).\nDescription: Mocha is a JavaScript testing framework for testing web applications"
  },
  {
    "name": "Nightwatch",
    "ring": "trial",
    "quadrant": "frameworks & tools",
    "isNew": "FALSE",
    "description": "Sub Category: Frameworks\nPlacement Reason: No deep experience.\nDescription: Nightwatch is a JavaScript testing framework for testing web applications"
  },
  {
    "name": "Gatling",
    "ring": "adopt",
    "quadrant": "frameworks & tools",
    "isNew": "FALSE",
    "description": "Sub Category: Frameworks\nPlacement Reason: One of the best frameworks for L&P Testing.\nDescription: Gatling is a load testing framework for testing web applications"
  },
  {
    "name": "JUnit5",
    "ring": "adopt",
    "quadrant": "frameworks & tools",
    "isNew": "FALSE",
    "description": "Sub Category: Frameworks\nPlacement Reason: Standard in the JVM world.\nDescription: JUnit is one of the most popular unit-testing frameworks in the Java ecosystem"
  },
  {
    "name": "Cucumber",
    "ring": "adopt",
    "quadrant": "frameworks & tools",
    "isNew": "FALSE",
    "description": "Sub Category: Tools\nPlacement Reason: Cucumber enables you to write scenarios that anyone can easily understand regardless of their technical knowledge.\nDescription: Cucumber is a software tool that supports behavior-driven development (BDD)"
  },
  {
    "name": "Maven",
    "ring": "hold",
    "quadrant": "frameworks & tools",
    "isNew": "FALSE",
    "description": "Sub Category: Tools\nPlacement Reason: Slower and less maintainable as gradle.\nDescription: Java build and dependency management tool using a 'Convention over configuration'-approach"
  },
  {
    "name": "Gradle",
    "ring": "adopt",
    "quadrant": "frameworks & tools",
    "isNew": "FALSE",
    "description": "Sub Category: Tools\nPlacement Reason: Fast, maintainable.\nDescription: Gradle is a build automation tool for multi-language software development"
  },
  {
    "name": "pyTest",
    "ring": "adopt",
    "quadrant": "frameworks & tools",
    "isNew": "FALSE",
    "description": "Sub Category: Frameworks\nPlacement Reason: pyTest is the de facto standard framework for testing Python code.\nDescription: PyTest is a testing framework that allows users to write test codes using Python programming language"
  },
  {
    "name": "React",
    "ring": "adopt",
    "quadrant": "frameworks & tools",
    "isNew": "FALSE",
    "description": "Sub Category: Frameworks\nPlacement Reason: Widely used.\nDescription: Java script library for building Front end applications. https://reactjs.org/"
  },
  {
    "name": "SBT",
    "ring": "trial",
    "quadrant": "frameworks & tools",
    "isNew": "TRUE",
    "description": "Sub Category: Tools\nPlacement Reason: Learn in combination with Scala.\nDescription: Scala build tool"
  },
  {
    "name": "Spring Boot",
    "ring": "adopt",
    "quadrant": "frameworks & tools",
    "isNew": "FALSE",
    "description": "Sub Category: Frameworks\nPlacement Reason: Widely used in the JVM world.\nDescription: The Spring Framework is an application framework and inversion of control container for the Java platform"
  },
  {
    "name": "Vue.js",
    "ring": "trial",
    "quadrant": "frameworks & tools",
    "isNew": "TRUE",
    "description": "Sub Category: Frameworks\nPlacement Reason: Get an overview on Vue.js\nDescription: Vue.js is a JavaScript Framework for building interactive web applications"
  },
  {
    "name": "Postman",
    "ring": "adopt",
    "quadrant": "frameworks & tools",
    "isNew": "FALSE",
    "description": "Sub Category: Tools\nPlacement Reason: Many useful features for Testing APIs. Widely used across IT industry.\nDescription: Postman is a web automation tool that allows users to test APIs"
  }
]
